<?php
require 'vendor/autoload.php';

// https://github.com/overtrue/pinyin
use Overtrue\Pinyin\Pinyin;
?>
<!DOCTYPE html>
<html lang="en">

<head>
  <meta charset="UTF-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>生词本</title>
  <link rel="stylesheet" href="style.css">
</head>

<body>
  <?php
  $words = [
    '《春夏秋冬》' => ['春雨', '春风', '风雨', '冬去', '春来', '冬雪', '下雪', '花草', '', '红花', '飞入', '飞鸟', '出入'],
    '《姓氏歌》' => ['姓名', '什么', '多么', '双手', '双双', '中国', '国王', '王子', '地方', '东方'],
    '《小青蛙》' => ['青草', '青云', '青春', '清水', '生气', '天气', '晴天', '心情', '请人', '请问', '生日'],
    '《猜字谜》' => ['文字', '字句', '左右', '左手', '左边', '右边', '又红', '又白', '红人', '几时', '', '心动', '动手', '千万', '万里无云'],
    '《吃水不忘挖井人》' => ['吃水', '吃力', '叫好', '大叫', '主人', '主动', '江水', '长江', '同住', '住口', '没有', '没用', '以后', '以来'],
    '《我多想去看看》' => ['开会', '大会', '走动', '走入', '北方', '北风', '北京', '大门', '门口', '广东'],
    '《四个太阳》' => ['太阳', '阳春', '学校', '校长', '金子', '金秋', '秋天', '秋雨', '因果', '因为', '为了'],
    '《小公鸡和小鸭子》' => ['他们', '他人', '河水', '小河', '听说', '说明', '也好', '也对', '地方', '土地', '听见', '听力', '哥哥', '大哥', '午觉', '自觉', '种子', '种树'],
    '《树和喜鹊》' => ['单手', '单子', '居住', '居中', '招手', '招呼', '呼叫', '飞快', '明快', '快乐', '可乐', '快乐', '音乐', '一只鸟', '只有', '都是', '首都'],
    '《静夜思》' => ['心思', '思乡', '床单', '木床', '上前', '门前', '阳光', '春光', '低头', '低下', '故乡', '故土', '乡下', '同乡'],
    '《怎么都快乐》' => ['玩伴', '好玩', '很好', '很多', '当时', '当地', '字音', '口音', '听讲', '讲和', '行走', '行动', '许多', '也许', '好人', '爱好', '当心', '上当', '得到', '跑得快', '可得'],
    '《夜色》' => ['金色', '秋色', '外国', '外地', '看见', '好看', '爸爸', '爸妈', '晚上', '早晚', '', '玩笑', '可笑', '再见', '再会', '看见', '看门', '散心', '散文'],
    '《端午粽》' => ['上午', '下午', '节日', '春节', '竹叶', '红叶', '大米', '小米', '真心', '真正', '分心', '万分', '豆子', '大豆', '十分', '分外', '中间', '黑白相间'],
    '《彩虹》' => ['那里', '那时', '看着', '讲着', '看到', '听到', '高大', '高山', '高兴', '兴头', '千万', '秋千', '成长', '成为', '高兴', '兴奋', '', '着急', '看着'],
    '《动物儿歌》' => ['中间', '时间', '迷人', '入迷', '人造', '造林', '运动', '运气', '池子', '水池', '欢乐', '欢笑', '上网', '网虫', '天空', '空白', '结实', '结果'],
    '《古对今》' => ['古时', '古人', '凉快', '清凉', '细心', '细雨', '夕阳', '前夕', '李子', '行李', '语气', '', '口语', '香气', '清香', '朝阳', '朝代'],
    '《操场上》' => ['打水', '打听', '拍手', '拍打', '长跑', '飞跑', '十足', '手足', '声音', '笑声', '身体', '全身', '体力', '全体'],
    '《人之初》' => ['之前', '相信', '远近', '学习', '远方', '玉米', '义气'],
    '《古诗二首》' => ['首长', '一首', '开采', '采用', '无声', '无人', '树叶', '大树', '爱心', '可爱', '尖刀', '尖子', '口角', '豆角', '露珠', '露面', '牛角', '角色'],
    '《荷叶圆圆》' => ['明亮', '月亮', '飞机', '手机', '台风', '讲台', '放学', '开放', '小鱼', '大鱼', '花朵', '云朵', '美好', '美工'],
    '《要下雨了》' => ['一直', '直到', '好呀', '飞呀', '河边', '江边', '你呢', '他呢', '是吗', '来吗', '是吧', '走吧', '加入', '加工', '闷热', '闷闷不乐'],
    '《文具的家》' => ['语文', '文字', '一次', '首次', '找到', '找人', '平分', '和平', '开办', '办学', '出让', '让开', '书包', '包办'],
    '《一分钟》' => ['时钟', '钟头', '一元', '单元', '洗手', '洗衣', '共同', '一共', '早已', '已经', '经过', '经办', '坐下', '请坐', '背包', '背后'],
    '《动物王国开大会》' => ['主要', '快要', '连长', '连声', '百万', '百姓', '还是', '还好', '舌头', '口舌', '电心', '点头', '还有', '还钱'],
    '《小猴子下山》' => ['石块', '土块', '非常', '是非', '经常', '常常', '前往', '往后', '西瓜', '冬瓜', '进去', '走进', '天空', '空手'],
    '《棉花糖姑娘》' => ['生病', '病人', '医生', '中医', '别人', '个别', '单干', '主干', '好奇', '奇才', '七天', '七夕', '星星', '星空', '干净', '干活'],
    '《咕咚》' => ['吓人', '吓住', '可怕', '怕生', '跟着', '跟从', '家乡', '大家', '小羊', '山羊', '大象', '小象', '都是', '大都'],
    '《小壁虎借尾巴》' => ['捉住', '捉虫', '字条', '条子', '爬行', '爬山', '姐姐', '大姐', '您好', '您早', '小草', '花草', '房子', '房间'],
  ];
  $words = [
    '第一单元词语过关' => [
      '春天', '冬天', '风雪', '入冬', '飞鸟',
      '春风', '雪花', '飞入', '开花', '青草',
      '姓氏', '什么', '多么', '双手', '四方',
      '一双', '中国', '国人', '王子', '天气',
      '双方', '一方', '生日', '学生', '动手',
      '青山', '清白', '清水', '清早', '大王',
      '生气', '力气', '晴天', '晴好', '加入',
      '心情', '人情', '请你', '请问', '生动',
      '生字', '左方', '左右', '红花', '青春',
      '有事', '火红', '动人', '一万', '一生',
    ],
    '第三单元词语闯关' => [
      '居住', '地上', '飞快', '动听', '快走', '主讲',
      '也好', '招手', '听见', '音乐', '也许', '大地',
      '少许', '招呼', '小说', '也对', '哥哥', '河水',
      '土地', '很少', '江河', '单人', '不行', '快乐',
      '呼气', '地里', '过河', '当心', '招生', '说书',
      '说明', '小河', '听讲', '河北', '不许', '也是',
      '他们', '可乐', '单个', '当时', '听说', '他人',
      '行人', '招工', '好玩', '听力', '他日', '单手',
      '地方', '玩乐', '行动', '很好', '行走', '哥们',
    ],
    '第三单元词语闯关2' => [
      '他们', '他人', '土地', '天地', '地方',
      '河水', '小河', '江河', '说书', '说明',
      '说话', '也好', '也是', '也许', '听说',
      '听见', '听课', '八个', '大哥', '单一',
      '单个', '单人', '居住', '居中', '家居',
      '招生', '招手', '招风', '呼气', '呼叫',
      '欢呼', '快来', '快走', '快乐', '乐趣',
      '玩乐', '玩火', '把玩', '很好', '当心',
      '当中', '口音', '音乐', '讲桌', '听讲',
      '行人', '行走', '行动', '许久', '许多',
    ],
    '第四单元词语过关' => [
      '心思', '三思', '床单', '河床', '前后',
      '前门', '月光', '风光', '低下', '低头',
      '故乡', '故土', '乡村', '思乡', '月色',
      '金色', '里外', '外面', '看见', '看上',
      '爸爸', '晚会', '晚秋', '玩笑', '可笑',
      '再见', '再三', '中午', '下午', '节日',
      '节目', '叶子', '大米', '小米', '真心',
      '真正', '分开', '分工', '大豆', '豆子',
      '那里', '那么', '看着', '到来', '见到',
      '高大', '高兴', '千万', '成全', '成长',
    ],
  ];
  $shuffle = true; // 打乱数组
  $onlyPinyin = true; // 不显示汉字只显示拼音

  foreach ($words as $className => $list) {
    echo '<dl>';
    // $className = Pinyin::sentence($className);
    echo "<dt>$className</dt>";
    echo '<dd><ul>';

    if ($shuffle) shuffle($list); // 打乱数组

    foreach ($list as $word) {
      $items = Pinyin::sentence($word)->toArray();
      echo '<li>';
      $chinese = preg_split('/(?<!^)(?!$)/u', $word);
      foreach ($items as $index => $pinyin) {
        $cn = '';
        $cn = $chinese[$index];
        if ($onlyPinyin) {
          $cn = '';
        }
        echo "<div class=\"word\"><span class=\"pinyin\">$pinyin</span><span class=\"unit\">$cn</span></div>";
      }
      echo '</li>';
    }
    echo '</ul></dd>';
    echo '</dl>';
  }
  ?>
</body>

</html>